Show / Hide Table of Contents
Class IdeaBeamImportSettings
Represents settings of improt options into Idea Connections
Inheritance
System.Object
IdeaBeamImportSettings
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Beam
Assembly: IdeaRS.OpenModel.dll
Syntax
public class IdeaBeamImportSettings
Constructors
Improve this Doc   View Source
IdeaBeamImportSettings()
Constructor - it sets default values
Declaration
public IdeaBeamImportSettings()
Properties
Improve this Doc   View Source
BeamFileName
Gets or sets the name of the Beam project
Declaration
public string BeamFileName { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
CanChangeDesignCodeInWizard
Can change design code in Wizard
Declaration
public bool CanChangeDesignCodeInWizard { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
DesignCode
Gets or sets the Design Code
Declaration
public string DesignCode { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
ExportAllLinearCombination
All linear combination will be exported to IDEA connection
Declaration
public bool ExportAllLinearCombination { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
UserWizardBrand
Set user Wizard Brand
Declaration
public string UserWizardBrand { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
UseWizard
Open import wizard window
Declaration
public bool UseWizard { get; set; }
Property Value
 Type |  Description
 System.Boolean
 Improve this Doc
 View Source